# Дан список чисел. Определите, сколько в нем встречается различных чисел.

list_numbers = [1,1,2,3,4,4,4,5,6,7,7]
list_unic_numbers=[]
list_unic_numbers=set(list_numbers)
len(list_unic_numbers)
print (list_numbers)
print(len(list_unic_numbers))

